In [1]:
import pandas as pd

In [2]:
ser = pd.Series(list("CAB"),index=[2,1,3])
ser

2    C
1    A
3    B
dtype: object

In [3]:
A = ser.sort_index()
A

1    A
2    C
3    B
dtype: object

In [4]:
A = ser.sort_index(ascending=False)
A

3    B
2    C
1    A
dtype: object

In [5]:
A = ser.sort_values(ascending=False)
A

2    C
3    B
1    A
dtype: object

In [6]:
ser = pd.Series(['E',None,"C"])
ser

0       E
1    None
2       C
dtype: object

In [7]:
ser.sort_values()

2       C
0       E
1    None
dtype: object

In [8]:
ser.sort_values(ascending=False)

0       E
2       C
1    None
dtype: object

In [9]:
arr = [
    [9,5,2],
    [6,8,1],
    [4,3,7]
]
df = pd.DataFrame(arr,index=[0,2,1],columns=list('cab'))
df

   c  a  b
0  9  5  2
2  6  8  1
1  4  3  7

In [10]:
df.sort_index(axis=1)

   a  b  c
0  5  2  9
2  8  1  6
1  3  7  4

In [11]:
df

   c  a  b
0  9  5  2
2  6  8  1
1  4  3  7

In [12]:
arr = [
    [9,4,8],
    [4,6,7],
    [4,5,3]
]
df = pd.DataFrame(arr,index=[0,2,1],columns=list('cab'))
df

   c  a  b
0  9  4  8
2  4  6  7
1  4  5  3

In [15]:
df.sort_values(by=['c','a'])

   c  a  b
1  4  5  3
2  4  6  7
0  9  4  8

In [16]:
df.sort_values(by='c')

   c  a  b
2  4  6  7
1  4  5  3
0  9  4  8

# Rank

In [17]:
df

   c  a  b
0  9  4  8
2  4  6  7
1  4  5  3

In [18]:
df.rank()

     c    a    b
0  3.0  1.0  3.0
2  1.5  3.0  2.0
1  1.5  2.0  1.0

In [19]:
df.rank(method="first")

     c    a    b
0  3.0  1.0  3.0
2  1.0  3.0  2.0
1  2.0  2.0  1.0

In [20]:
df.rank(method="max")

     c    a    b
0  3.0  1.0  3.0
2  2.0  3.0  2.0
1  2.0  2.0  1.0

In [22]:
df.rank(method="min",ascending=False)

     c    a    b
0  1.0  3.0  1.0
2  2.0  1.0  2.0
1  2.0  2.0  3.0

In [25]:
import numpy as np
import math
import pandas as pd
df1 = pd.DataFrame({
    'stu_nu':['stu1','stu2','stu1','stu3','stu1','stu2','stu4','stu3'],
    'score':np.random.randint(50,100,size=8)
})
df1

  stu_nu  score
0   stu1     68
1   stu2     72
2   stu1     80
3   stu3     92
4   stu1     89
5   stu2     64
6   stu4     72
7   stu3     91

In [27]:
df2 = pd.DataFrame({
    'stu_nu':['stu1','stu2','stu3','stu5'],
    'name':['张三','李四','王五','赵六']
})
df2

  stu_nu name
0   stu1   张三
1   stu2   李四
2   stu3   王五
3   stu5   赵六

In [30]:
pd.merge(df1,df2,on='stu_nu')

  stu_nu  score name
0   stu1     68   张三
1   stu1     80   张三
2   stu1     89   张三
3   stu2     72   李四
4   stu2     64   李四
5   stu3     92   王五
6   stu3     91   王五

In [32]:
pd.merge(df1,df2,on='stu_nu',how='left')

  stu_nu  score name
0   stu1     68   张三
1   stu2     72   李四
2   stu1     80   张三
3   stu3     92   王五
4   stu1     89   张三
5   stu2     64   李四
6   stu4     72  NaN
7   stu3     91   王五

In [33]:
pd.merge(df1,df2,on='stu_nu',how='right')

  stu_nu  score name
0   stu1   68.0   张三
1   stu1   80.0   张三
2   stu1   89.0   张三
3   stu2   72.0   李四
4   stu2   64.0   李四
5   stu3   92.0   王五
6   stu3   91.0   王五
7   stu5    NaN   赵六

In [34]:
pd.merge(df1,df2,on='stu_nu',how='outer')

  stu_nu  score name
0   stu1   68.0   张三
1   stu1   80.0   张三
2   stu1   89.0   张三
3   stu2   72.0   李四
4   stu2   64.0   李四
5   stu3   92.0   王五
6   stu3   91.0   王五
7   stu4   72.0  NaN
8   stu5    NaN   赵六

In [36]:
df1 = pd.DataFrame(np.arange(1,5).reshape(2,-1))
df1

   0  1
0  1  2
1  3  4

In [39]:
df2 = pd.DataFrame(np.zeros((2,2)))
df2

     0    1
0  0.0  0.0
1  0.0  0.0

In [40]:
pd.concat([df1,df2])

     0    1
0  1.0  2.0
1  3.0  4.0
0  0.0  0.0
1  0.0  0.0

In [41]:
pd.concat([df1,df2],axis=1)

   0  1    0    1
0  1  2  0.0  0.0
1  3  4  0.0  0.0

In [ ]:
pd.concat([df1,],axis=1)